src/InformationRegisters/ОтветственныеПоИсточникам/ОтветственныеПоИсточникам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОтветственныеПоИсточникам</name>
  <dimensions>
    <name>Источник</name>
    <type>
      <types>BusinessProcessRef.ПредварительнаяПроверка</types>
      <types>CatalogRef.ИсторияХранилища</types>
      <types>BusinessProcessRef.СогласованиеПереноса</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/ЗадачиМетеорВерсийХранилища/ЗадачиМетеорВерсийХранилища.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЗадачиМетеорВерсийХранилища</name>
  <resources>
    <name>ЗадачаМетеор</name>
    <type>
      <types>CatalogRef.ЗадачиМетеор</types>
    </type>
  </resources>
  <dimensions>
    <name>ВерсияХранилища</name>
    <type>
      <types>CatalogRef.ИсторияХранилища</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/ТекущийЭтапЗадачиМетеор/ТекущийЭтапЗадачиМетеор.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ТекущийЭтапЗадачиМетеор</name>
  <resources>
    <name>Этап</name>
    <type>
      <types>CatalogRef.ЭтапыЗадачиМетеор</types>
    </type>
  </resources>
  <resources>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <resources>
    <name>Тип</name>
    <type>
      <types>CatalogRef.ТипыЗадачиМетеор</types>
    </type>
  </resources>
  <dimensions>
    <name>ЗадачаМетеор</name>
    <type>
      <types>CatalogRef.ЗадачиМетеор</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Catalogs/Пользователи/Пользователи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Пользователи</name>
  <comment>АПК:413 - №744.2.1.1 Допустимо не отключать историю выбора, так как она используется, а переопределение отбора фиксированное, то есть служебные и недействительные пользователи в нее не попадут, но если как-то попали, то это не является проблемой</comment>
  <attributes>
    <name>ПользовательОС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Команда</name>
    <type>
      <types>CatalogRef.Команды</types>
    </type>
  </attributes>
  <attributes>
    <name>email</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТелеграмID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МетеорИД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Недействителен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>DefinedType.Подразделение</types>
    </type>
  </attributes>
  <attributes>
    <name>ФизическоеЛицо</name>
    <type>
      <types>DefinedType.ФизическоеЛицо</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Служебный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подготовлен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяИБ</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяСервиса</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>СвойстваПользователяИБ</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Фотография</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Удалить_УИ</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДляСписка</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/InformationRegisters/ОтветственныеПоИсточникам/ManagerModule.bsl
Процедура ОбновитьОтвественных(Источник) Экспорт
	
	Если ТипЗнч(Источник) = Тип("БизнесПроцессСсылка.ПредварительнаяПроверка") 
		ИЛИ ТипЗнч(Источник) = Тип("БизнесПроцессСсылка.СогласованиеПереноса") Тогда
	
		Набор = РегистрыСведений.ОтветственныеПоИсточникам.СоздатьНаборЗаписей();
		Набор.Отбор.Источник.Установить(Источник);
		
		ДобавитьЗапись(Набор, Источник.Аналитик);
		ДобавитьЗапись(Набор, Источник.Разработчик);
		ДобавитьЗапись(Набор, Источник.Исполнитель);
		ДобавитьЗапись(Набор, Источник.Проверил_ПроверкаКода);
		
		ТЗ = Набор.Выгрузить();
		ТЗ.Свернуть("Источник, Ответственный");
		Набор.Загрузить(ТЗ);
		
		Набор.Записать();
		
	ИначеЕсли ТипЗнч(Источник) = Тип("СправочникСсылка.ИсторияХранилища") Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ
			|	ИсторияХранилища.Ссылка КАК Источник,
			|	Пользователи.Ссылка КАК Ответственный
			|ИЗ
			|	Справочник.ИсторияХранилища КАК ИсторияХранилища
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Пользователи КАК Пользователи
			|		ПО ИсторияХранилища.Автор = Пользователи.Код
			|ГДЕ
			|	ИсторияХранилища.Ссылка = &Источник
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ЗадачиМетеорВерсийХранилища.ВерсияХранилища,
			|	ТекущийЭтапЗадачиМетеор.Исполнитель
			|ИЗ
			|	РегистрСведений.ЗадачиМетеорВерсийХранилища КАК ЗадачиМетеорВерсийХранилища
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ТекущийЭтапЗадачиМетеор КАК ТекущийЭтапЗадачиМетеор
			|		ПО ЗадачиМетеорВерсийХранилища.ЗадачаМетеор = ТекущийЭтапЗадачиМетеор.ЗадачаМетеор
			|ГДЕ
			|	ЗадачиМетеорВерсийХранилища.ВерсияХранилища = &Источник";
		Запрос.УстановитьПараметр("Источник", Источник);
		
		Набор = РегистрыСведений.ОтветственныеПоИсточникам.СоздатьНаборЗаписей();
		Набор.Отбор.Источник.Установить(Источник);
		ТЗ = Запрос.Выполнить().Выгрузить();
		ТЗ.Свернуть("Источник, Ответственный");
		Набор.Загрузить(ТЗ);
		Набор.Записать();
		
	ИначеЕсли ТипЗнч(Источник) = Тип("СправочникСсылка.ЗадачиМетеор") Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ
			|	ЗадачиМетеорВерсийХранилища.ВерсияХранилища КАК Источник,
			|	ТекущийЭтапЗадачиМетеор.Исполнитель КАК Ответственный
			|ИЗ
			|	РегистрСведений.ЗадачиМетеорВерсийХранилища КАК ЗадачиМетеорВерсийХранилища
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ТекущийЭтапЗадачиМетеор КАК ТекущийЭтапЗадачиМетеор
			|		ПО ЗадачиМетеорВерсийХранилища.ЗадачаМетеор = ТекущийЭтапЗадачиМетеор.ЗадачаМетеор
			|ГДЕ
			|	ЗадачиМетеорВерсийХранилища.ЗадачаМетеор = &Источник";
		Запрос.УстановитьПараметр("Источник", Источник);
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			Если Не ЗначениеЗаполнено(Выборка.Ответственный) Тогда
				Продолжить;
			КонецЕсли;
			Запись = РегистрыСведений.ОтветственныеПоИсточникам.СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(Запись, Выборка);
			Запись.Записать();
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьЗапись(Набор, Ответственный)
	Если ЗначениеЗаполнено(Ответственный) Тогда
		Запись = Набор.Добавить();
		Запись.Источник = Набор.Отбор.Источник.Значение;
		Запись.Ответственный = Ответственный;
	КонецЕсли;
КонецПроцедуры

Процедура Перезаполнить() Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	БизнесПроцесс.Ссылка КАК Источник,
		|	БизнесПроцесс.Аналитик КАК Ответственный
		|ПОМЕСТИТЬ Ответственные
		|ИЗ
		|	БизнесПроцесс.ПредварительнаяПроверка КАК БизнесПроцесс
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	БизнесПроцесс.Ссылка,
		|	БизнесПроцесс.Разработчик
		|ИЗ
		|	БизнесПроцесс.ПредварительнаяПроверка КАК БизнесПроцесс
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	БизнесПроцесс.Ссылка,
		|	БизнесПроцесс.Исполнитель
		|ИЗ
		|	БизнесПроцесс.ПредварительнаяПроверка КАК БизнесПроцесс
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	БизнесПроцесс.Ссылка,
		|	БизнесПроцесс.Проверил_ПроверкаКода
		|ИЗ
		|	БизнесПроцесс.ПредварительнаяПроверка КАК БизнесПроцесс
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	БизнесПроцесс.Ссылка,
		|	БизнесПроцесс.Аналитик
		|ИЗ
		|	БизнесПроцесс.СогласованиеПереноса КАК БизнесПроцесс
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	БизнесПроцесс.Ссылка,
		|	БизнесПроцесс.Разработчик
		|ИЗ
		|	БизнесПроцесс.СогласованиеПереноса КАК БизнесПроцесс
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	БизнесПроцесс.Ссылка,
		|	БизнесПроцесс.Исполнитель
		|ИЗ
		|	БизнесПроцесс.СогласованиеПереноса КАК БизнесПроцесс
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	БизнесПроцесс.Ссылка,
		|	БизнесПроцесс.Проверил_ПроверкаКода
		|ИЗ
		|	БизнесПроцесс.СогласованиеПереноса КАК БизнесПроцесс
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ИсторияХранилища.Ссылка,
		|	Пользователи.Ссылка
		|ИЗ
		|	Справочник.ИсторияХранилища КАК ИсторияХранилища
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Пользователи КАК Пользователи
		|		ПО ИсторияХранилища.Автор = Пользователи.Код
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ЗадачиМетеорВерсийХранилища.ВерсияХранилища,
		|	ТекущийЭтапЗадачиМетеор.Исполнитель
		|ИЗ
		|	РегистрСведений.ЗадачиМетеорВерсийХранилища КАК ЗадачиМетеорВерсийХранилища
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ТекущийЭтапЗадачиМетеор КАК ТекущийЭтапЗадачиМетеор
		|		ПО ЗадачиМетеорВерсийХранилища.ЗадачаМетеор = ТекущийЭтапЗадачиМетеор.ЗадачаМетеор
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Ответственные.Источник КАК Источник,
		|	Ответственные.Ответственный КАК Ответственный
		|ИЗ
		|	Ответственные КАК Ответственные
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Пользователи КАК Пользователи
		|		ПО Ответственные.Ответственный = Пользователи.Ссылка";
	Набор = РегистрыСведений.ОтветственныеПоИсточникам.СоздатьНаборЗаписей();
	Набор.Загрузить(Запрос.Выполнить().Выгрузить());
	Набор.Записать();
КонецПроцедуры
